Revit 2024 API
PanelScheduleData.PanelConfiguration Property
 The panel configuration of this panel schedule
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public PanelConfiguration PanelConfiguration { get; }
Visual Basic
Public ReadOnly Property PanelConfiguration As PanelConfiguration
	Get
Visual C++
public:
property PanelConfiguration PanelConfiguration {
	PanelConfiguration get ();
}
See Also
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace